public class Dictionary {
    public static final String[] WORDS = {

            "студенти",
            "дім", "мова", "дощ", "сонце", "книга",
            "квіти", "сніг", "море", "гора", "парк",
            "птах", "сніданок", "вечеря", "час", "день",
            "зірка", "лист", "пляж", "вікно", "мальовничий",
            "сніжинка", "дитина", "вчитель", "друг", "країна",
            "мистецтво", "музика", "радість", "здоров'я", "поцілунок",
            "відпочинок", "відпустка", "герой", "веселощі", "спогад",
            "смуток", "небо", "мрія", "диво", "похмурість",
            "святковий", "парфуми", "подорож", "місто", "метелик",
            "забавка", "ромашка", "літо", "осінь", "зима",
            "весна", "кава", "чай", "смаколики", "вітер",
            "морозиво", "служба", "війна", "мир", "мистецтво",
            "захід", "сходинки", "двері", "стіл", "стільці",
            "віконце", "візок", "погода", "блискавка", "гроза",
            "метеор", "магазин", "парашут", "річка", "дорога",
            "сукня", "весілля", "медаль", "подушка", "дівчина",
            "хлопець", "батьки", "гітара", "квартира", "сусіди",
            "квартал", "постать", "школа", "университет", "клас",
            "студент", "викладач", "майстер", "виробник", "винахідник",
            "з", "до", "на", "в", "під",
            "за", "перед", "після", "при", "від",
            "всередині", "навколо", "поза", "над", "під",
            "спереду", "ззаду", "поміж", "навпроти", "попри",
            "по", "через", "згідно", "внаслідок", "всупереч",
            "вгорі", "внизу", "замість", "між", "у",
            "біля", "без", "відповідно", "згідно", "поза",
            "уздовж", "назустріч", "наперекір", "по-за", "посеред",
            "навпроти", "наперекір", "навздогінь", "навпростець", "понаріз",
            "нагорі", "нагорів", "нагору", "направо", "наліво",
            "наприкінці", "насередині", "надворі", "навбоки", "напоперек",
            "напідпитку", "напоперед", "насухо", "наввиперед", "навскоси",
            "намокро", "наголо", "наскоками", "напівдорозі", "навпіл",
            "нашпигований", "наподвір'ї", "напідстрочений", "навмання", "наспіх",
            "наввипередки", "насухе", "напівприхилявши", "навздогін", "наповзунок",
            "навман", "надворний", "наскіс", "наддверний", "надохоч",
            "надкровляний", "надпровідний", "надпалений", "надплавний", "надрукований",
            "говорити", "читати", "приходити", "ходити", "думати",
            "працювати", "любити", "співати", "танцювати", "розуміти",
            "бачити", "слухати", "зробити", "приїхати", "починати",
            "закінчувати", "допомагати", "знати", "вивчати", "відпочивати",
            "подорожувати", "вірити", "пропонувати", "робити", "сподіватися",
            "вчиться", "пам'ятати", "забувати", "повертатися", "спати",
            "дати", "взяти", "дивитися", "відповідати", "помічати",
            "шукати", "знаходити", "вимовляти", "писати", "змінювати",
            "відкривати", "закривати", "співпрацювати", "вибирати", "закінчувати",
            "подолати", "доводити", "перекладати", "використовувати", "дивуватися",
            "служити", "працювати", "перемагати", "керувати", "вчити",
            "застосовувати", "розвивати", "зробити", "досліджувати", "залишатися",
            "пропускати", "приймати", "впливати", "поступатися", "критикувати",
            "відчувати", "вбивати", "приваблювати", "грати", "сміятися",
            "виконувати", "відмовлятися", "збиратися", "захищатися", "сподіватися",
            "навчатися", "вчити", "знаходити", "робити", "говорити",
            "слухати", "читати", "думати", "працювати", "приходити",
            "закінчувати", "починати", "допомагати", "знати", "вивчати",
            "Великий", "Маленький", "Гарний", "Чудовий", "Смачний",
            "Червоний", "Синій", "Зелений", "Жовтий", "Білий",
            "Чорний", "Теплий", "Холодний", "Мокрий", "Сухий",
            "Швидкий", "Повільний", "Сильний", "Слабкий", "Красивий",
            "Гарячий", "Сміливий", "Лагідний", "Люб'язний", "Здоровий",
            "Щасливий", "Сумний", "Веселий", "Радісний", "Нудний"
    };

//    public static boolean containsWord(String word) {
//        for (String dictWord : WORDS) {
//            if (dictWord.equalsIgnoreCase(word)) {
//                return true;
//            }
//        }
//        return false;
//    }

}
